In [2]:
import pandas as pd

In [ ]:
# saries datatype
colours=pd.Series(["Red","Blue","White"])

In [ ]:
# 1-dimesional
colours

0      Red
1     Blue
2    White
dtype: object

In [ ]:
# DataFrame=2-dimensional
# takes python a dictionary
df=pd.DataFrame({"Car make": (pd.Series(["BMW","Toyota","Honda"])), "Colour": colours})
df

  Car make Colour
0      BMW    Red
1   Toyota   Blue
2    Honda  White

In [9]:
# Import data
#from google.colab import files
#uploaded = files.upload()
car_sales=pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

##  Describe data

In [ ]:
# Atrribute
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [ ]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [ ]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [ ]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [ ]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [ ]:
car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [ ]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [ ]:
car_sales["Doors"].sum()

40

In [ ]:
len(car_sales)

10

## Viewing and selecting data

In [ ]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [ ]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [ ]:
animals=pd.Series(["cat","dog","snake","panda"],index=[7,5,3,3])

In [ ]:
animals

7      cat
5      dog
3    snake
3    panda
dtype: object

In [ ]:
# loc for index
animals.loc[3]

3    snake
3    panda
dtype: object

In [ ]:
# iloc for postion
animals.iloc[0]

'cat'

In [ ]:
car_sales.loc[2]

Make                Toyota
Colour                Blue
Odometer (KM)        32549
Doors                    3
Price            $7,000.00
Name: 2, dtype: object

In [ ]:
car_sales.iloc[2]

Make                Toyota
Colour                Blue
Odometer (KM)        32549
Doors                    3
Price            $7,000.00
Name: 2, dtype: object

In [ ]:
car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [ ]:
car_sales['Make']

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [ ]:
car_sales[car_sales["Make"]=="Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [ ]:
car_sales[car_sales["Odometer (KM)"]>10000]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [ ]:
#Wrong syntax
car_sales.Odometer (KM)

AttributeError: 'DataFrame' object has no attribute 'Odometer'

In [7]:
# Column from Series
seats_column = pd.Series([5,5,5,5,5,5])

In [10]:
# New column called seats
car_sales["Seats"] = seats_column

In [12]:
car_sales["Seats"].fillna(5,inplace=True)

In [13]:
# Column from python list
fuel_economy = [7.5,9.2,5.0,9.6,8.7,4.7,7.6,8.7,3.0,4.5]
car_sales["Fuel per 100KM"]=fuel_economy
car_sales

     Make Colour  Odometer (KM)  Doors       Price  Seats  Fuel per 100KM
0  Toyota  White         150043      4   $4,000.00    5.0             7.5
1   Honda    Red          87899      4   $5,000.00    5.0             9.2
2  Toyota   Blue          32549      3   $7,000.00    5.0             5.0
3     BMW  Black          11179      5  $22,000.00    5.0             9.6
4  Nissan  White         213095      4   $3,500.00    5.0             8.7
5  Toyota  Green          99213      4   $4,500.00    5.0             4.7
6   Honda   Blue          45698      4   $7,500.00    5.0             7.6
7   Honda   Blue          54738      4   $7,000.00    5.0             8.7
8  Toyota  White          60000      4   $6,250.00    5.0             3.0
9  Nissan  White          31600      4   $9,700.00    5.0             4.5

In [14]:
car_sales["Total fuel used (L)"] = car_sales["Odometer (KM)"]/100 * car_sales["Fuel per 100KM"]
car_sales

     Make Colour  Odometer (KM)  ...  Seats Fuel per 100KM  Total fuel used (L)
0  Toyota  White         150043  ...    5.0            7.5            11253.225
1   Honda    Red          87899  ...    5.0            9.2             8086.708
2  Toyota   Blue          32549  ...    5.0            5.0             1627.450
3     BMW  Black          11179  ...    5.0            9.6             1073.184
4  Nissan  White         213095  ...    5.0            8.7            18539.265
5  Toyota  Green          99213  ...    5.0            4.7             4663.011
6   Honda   Blue          45698  ...    5.0            7.6             3473.048
7   Honda   Blue          54738  ...    5.0            8.7             4762.206
8  Toyota  White          60000  ...    5.0            3.0             1800.000
9  Nissan  White          31600  ...    5.0            4.5             1422.000

[10 rows x 8 columns]

In [16]:
# Create a column from a single value
car_sales["Number of wheels"]=4
car_sales["Passed road safety"]=True
car_sales.drop("Total fuel used (L)", axis=1,inplace=True) # axis=1 for column

In [17]:
car_sales

     Make Colour  ...  Number of wheels  Passed road safety
0  Toyota  White  ...                 4                True
1   Honda    Red  ...                 4                True
2  Toyota   Blue  ...                 4                True
3     BMW  Black  ...                 4                True
4  Nissan  White  ...                 4                True
5  Toyota  Green  ...                 4                True
6   Honda   Blue  ...                 4                True
7   Honda   Blue  ...                 4                True
8  Toyota  White  ...                 4                True
9  Nissan  White  ...                 4                True

[10 rows x 9 columns]

In [19]:
car_sales_shuffled = car_sales.sample(frac=1)

In [20]:
car_sales_shuffled

     Make Colour  ...  Number of wheels  Passed road safety
7   Honda   Blue  ...                 4                True
2  Toyota   Blue  ...                 4                True
0  Toyota  White  ...                 4                True
5  Toyota  Green  ...                 4                True
4  Nissan  White  ...                 4                True
9  Nissan  White  ...                 4                True
8  Toyota  White  ...                 4                True
6   Honda   Blue  ...                 4                True
3     BMW  Black  ...                 4                True
1   Honda    Red  ...                 4                True

[10 rows x 9 columns]

In [21]:
# Only 20% of the data
car_sales_shuffled.sample(frac=0.2)

     Make Colour  ...  Number of wheels  Passed road safety
0  Toyota  White  ...                 4                True
1   Honda    Red  ...                 4                True

[2 rows x 9 columns]

In [22]:
car_sales_shuffled.reset_index(drop=True, inplace=True)

In [23]:
car_sales_shuffled

     Make Colour  ...  Number of wheels  Passed road safety
0   Honda   Blue  ...                 4                True
1  Toyota   Blue  ...                 4                True
2  Toyota  White  ...                 4                True
3  Toyota  Green  ...                 4                True
4  Nissan  White  ...                 4                True
5  Nissan  White  ...                 4                True
6  Toyota  White  ...                 4                True
7   Honda   Blue  ...                 4                True
8     BMW  Black  ...                 4                True
9   Honda    Red  ...                 4                True

[10 rows x 9 columns]

In [25]:
car_sales["Odometer (KM)"] = car_sales["Odometer (KM)"].apply(lambda x: x/1.6)

In [26]:
car_sales

     Make Colour  ...  Number of wheels  Passed road safety
0  Toyota  White  ...                 4                True
1   Honda    Red  ...                 4                True
2  Toyota   Blue  ...                 4                True
3     BMW  Black  ...                 4                True
4  Nissan  White  ...                 4                True
5  Toyota  Green  ...                 4                True
6   Honda   Blue  ...                 4                True
7   Honda   Blue  ...                 4                True
8  Toyota  White  ...                 4                True
9  Nissan  White  ...                 4                True

[10 rows x 9 columns]